IDEA Open Model
Material.UserThermalStressStrainCurvature Property
Compatible with IDEA StatiCa 20.1
 User-defined curvature for thermal stress,strain { Temperature = Θ[K], {x = ε[-], y = σ[Pa]}}
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public List<TemperatureCurve2D> UserThermalStressStrainCurvature { get; set; }
Public Property UserThermalStressStrainCurvature As List(Of TemperatureCurve2D)
	Get
	Set
Property Value
Type: List<TemperatureCurve2D>
See Also
Reference
Material Class
IdeaRS.OpenModel.Material Namespace